tests/results/OpenFOAM_cylinder_LSTM/FOAM/constant/polyMesh/blockMeshDict
// The OpenFOAM Project // File: blockMeshDict
/*
-------------------------------------------------------------------------------
 =========         | dictionary
 \\      /         |
  \\    /          | Name:   blockMeshDict
   \\  /           | Family: FoamX configuration file
    \\/            |
    F ield         | OpenFOAM version: 2.3
    O peration     | Product of Nabla Ltd.
    A and          |
    M anipulation  | Email: Enquiries@Nabla.co.uk
-------------------------------------------------------------------------------
*/
// FoamX Case Dictionary.
 
FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (0       0.0   -0.5)
    (2.8787  0.0   -0.5)
    (7.1213  0.0   -0.5)
    (25      0.0   -0.5)
    (0      5.3787 -0.5)
    (2.8787 5.3787 -0.5)
    (7.1213 5.3787 -0.5)
    (25     5.3787 -0.5)
    (4.6464 7.1464 -0.5)
    (5.3536 7.1464 -0.5)
    (4.6464 7.8536 -0.5)
    (5.3536 7.8536 -0.5)
    (0      9.6213 -0.5)
    (2.8787 9.6213 -0.5)
    (7.1213 9.6213 -0.5)
    (25     9.6213 -0.5)
    (0      16.0   -0.5)
    (2.8787 16.0   -0.5)
    (7.1213 16.0   -0.5)
    (25     16.0   -0.5)

    (0       0.0   0.5)
    (2.8787  0.0   0.5)
    (7.1213  0.0   0.5)
    (25      0.0   0.5)
    (0      5.3787 0.5)
    (2.8787 5.3787 0.5)
    (7.1213 5.3787 0.5)
    (25     5.3787 0.5)
    (4.6464 7.1464 0.5)
    (5.3536 7.1464 0.5)
    (4.6464 7.8536 0.5)
    (5.3536 7.8536 0.5)
    (0      9.6213 0.5)
    (2.8787 9.6213 0.5)
    (7.1213 9.6213 0.5)
    (25     9.6213 0.5)
    (0      16.0   0.5)
    (2.8787 16.0   0.5)
    (7.1213 16.0   0.5)
    (25     16.0   0.5)

);
 
blocks
(

    hex ( 0  1  5  4 20 21 25 24) (30 25 1) simpleGrading (1    0.25    1)
    hex ( 1  2  6  5 21 22 26 25) (50 25 1) simpleGrading (1    0.25    1)
    hex ( 2  3  7  6 22 23 27 26) (75 25 1) simpleGrading (2 0.25    1)
    hex ( 4  5 13 12 24 25 33 32) (30 50 1) simpleGrading (1    1    1)
    hex ( 5  6  9  8 25 26 29 28) (50 45 1) simpleGrading (1    0.5  1)
    hex ( 9  6 14 11 29 26 34 31) (45 50 1) simpleGrading (2    1    1)
    hex (10 11 14 13 30 31 34 33) (50 45 1) simpleGrading (1    2    1)
    hex ( 5  8 10 13 25 28 30 33) (45 50 1) simpleGrading (0.5  1    1)
    hex ( 6  7 15 14 26 27 35 34) (75 50 1) simpleGrading (2 1    1)
    hex (12 13 17 16 32 33 37 36) (30 25 1) simpleGrading (1    4    1)
    hex (13 14 18 17 33 34 38 37) (50 25 1) simpleGrading (1    4    1)
    hex (14 15 19 18 34 35 39 38) (75 25 1) simpleGrading (2 4    1)

);

edges
(
    arc  5  6 (5   4.5   -0.5)
    arc  6 14 (8   7.5   -0.5)
    arc 14 13 (5   10.5  -0.5)
    arc 13  5 (2   7.5   -0.5)
    arc  8  9 (5   7.0   -0.5)
    arc  9 11 (5.5 7.5   -0.5)
    arc 11 10 (5   8.0   -0.5)
    arc 10  8 (4.5 7.5   -0.5)

    arc 25 26 (5   4.5   0.5)
    arc 26 34 (8   7.5   0.5)
    arc 34 33 (5   10.5  0.5)
    arc 33 25 (2   7.5   0.5)
    arc 28 29 (5   7.0   0.5)
    arc 29 31 (5.5 7.5   0.5)
    arc 31 30 (5   8.0   0.5)
    arc 30 28 (4.5 7.5   0.5)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            (10  8 28 30)
            ( 8  9 29 28)
            ( 9 11 31 29)
            (11 10 30 31)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            ( 4  0 20 24)
            (12  4 24 32)
            (16 12 32 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            ( 3  7 27 23)
            ( 7 15 35 27)
            (15 19 39 35)
        );
    }
    symUp
    {
        type            slip;
        faces
        (
            (17 16 36 37)
            (18 17 37 38)
            (19 18 38 39)
        );
    }
    symDown
    {
        type            slip;
        faces
        (
            (0 1 21 20)
            (1 2 22 21)
            (2 3 23 22)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  4  5  1)
            ( 1  5  6  2)
            ( 2  6  7  3)
            ( 4 12 13  5)
            ( 5  8  9  6)
            ( 9 11 14  6)
            (10 13 14 11)
            ( 5 13 10  8)
            ( 6 14 15  7)
            (12 16 17 13)
            (13 17 18 14)
            (14 18 19 15)

            (21 25 24 20)
            (21 22 26 25)
            (22 23 27 26)
            (24 25 33 32)
            (25 26 29 28)
            (26 34 31 29)
            (30 31 34 33)
            (25 28 30 33)
            (26 27 35 34)
            (32 33 37 36)
            (33 34 38 37)
            (34 35 39 38)

        );
    }
);


mergePatchPairs
(
);
 
// ************************************************************************* //
